package tamgochy;
import java.util.ArrayList;


class Texts {
    static String info = "Привет! Я чат-бот тамагочи. Чтобы начать новую игру, дай мне имя и представья сам. " +
            "Чтобы узнать, какие команды тебе доступны, введи \"Команды\". Чтобы узнать, как у меня дела, " +
            "напиши \"Проверка\". Чтобы остановить игру, напиши \"выход\"";
    static String commands = "Проверка, Питание, Сон, Гигиена, Tуалет, Счастье";
    static String[] needs = {"Питание", "Сон", "Гигиена", "Tуалет", "Счастье"};





}
