{
	"message": "...Пересекая очередную опушку, питомец заметил в траве что-то блестящее. Подойдя поближе, он с радостью и удивлением понял, что это - какой-то драгоценный камень насыщенного синего цвета. Недолго думая, он взял этот камень в руки, и в то же мгновение в его сознании что-то оборвалось, веки сомкнулись, словно налитые свинцом... спины коснулось что-то мягкое и холодное... это трава?... В нос ударил запах прелой листвы, и все внутри перевернулось...",
	"requiredHunger": 70,
	"requiredHealth": 60,
	"requiredSleep": 40,
	
	"reward": 100,
	"successMessage": "Не желая медлить, ваш питомец тут же вскочил на ноги, и... то ли с радостью, то ли с огорчением осознал, что он очутился в женском теле! Глядя на себя сверху вниз, он видел точеный силуэт, подчеркнутый платьем из шелка, бархата, может быть, батиста... На этом текстильные познания нашего героя закончились, и он, шокированный, решил, что лучший способ получить ответы на все вопросы - пойти вперед. То есть, куда-нибудь. В любую сторону. При первом шаге в районе пояса что-то обнадеживающе звякнуло - то был замшевый кошель, туго набитый монетами",
	
	"onFailHunger": -20,
	"onFailSleep": 100,
	"onFailToilet": -15,
	"failMessage": "К сожалению, организм питомца не был готов к таким... активным событиям, и, не успев осознать, что происходит, он тут же провалился в беспробудный сон. Спустя некоторое время он очнулся, и первое, что питомец почувствовал - холод. Пальцы рук и ног словно окоченели. Кое-как сумев подняться, он окинул взглядом себя... или уже не себя! Да, взглянув на себя, питомец понял, что оказался в чужом теле. В чужом ЖЕНСКОМ теле. Которое закрывало лишь нечто, смахивающее на хлопковую сорочку. Неудивительно, что ему... ей было так холодно. К счастью, рядом лежал ворох какой-то ткани, при ближнем рассмотрении оказавшийся грязным, помятым, местами порванным платьем. Интересно, почему оно оказалось отдельно от девушки?.. Не желая больше мерзнуть, наша новоиспеченная героиня натянула остатки некогда прекрасного платья и, желая узнать, что же произошло, двинулась вперед!"
}