{
	"messages":  "Девушка могла бы вечность бродить по торговой площади (такова уж женская натура...) но громогласное 'Виктория!!!' нарушило все ее планы. Нутром почувствовав, что обращаются к ней, она обернулась. И увидела перед собой богато одетого мужчину. Его черные, густые волосы и бороду уже поддернула седина. Черные-черные глаза в обрамлении густых нахмуренныз бровей смотрели прямо на девушку, которую, судя по всему, звали Викторией. 'Куда ты опять запропастилась, юная леди?' - продолжал тем временем свои грозные речи незнакомый мужчина. - 'Мне казалось, после нашего последнего разговора мы уладили все проблемы, но нет же!.. Ты идешь со мной! Немедленно!' - Мужчина решительно направился к ней.",
	"requiredHunger": 60,
	"requiredHealth": 80,
	
	"successHealth": -50,
	"successSleep": 100,
	"successClean": -20,
	"successToilet": -50,
	"successMessage": "Новоиспеченная Виктория чувствовала, что у нее достаточно сил, чтобы сопротивляться этому мужчине. Пусть он и казался ей хорошо знакомым, ей не хотелось никуда идти по чужой воле! Встав в боевую позу, она приготовилась защищаться. Вот он пошел на нее быстрым, решительным шагом, вот замахнулся... Виктория напряглась и... сильные мужские руки перехватили ее собственные, до боли сжав их. Всего мгновение - и мужчина оказался позади нее, словно телепортировавшись, а кожу лица стало неприятно покалывать словно электрическим током... Люди вокруг ахнули от изумления, но не спешили помочь девушке. Еще через пару мгновений она потеряла сознание.",
	
	"onFailHunger": 50,
	"onFailSleep": 100,
	"onFailToilet": -50,
	"successClean": 10,
	"failMessage": "Оценив свои шансы, девушка решила не сопротивляться. Она послушно позволила мужчине за руку отвести ее на окраину города и посадить в карету. Сам он сел напротив. За окном проносились мрачные пейзажы. Вскоре полил дождь. На одной из остановок, мужчина вышел из кареты и знаком велел Виктории следовать за ней. 'Подставь ладони' - сказал он. Девушка послушалась, и тогда мужчина плеснул ей на руки холодной воды из бурдюка. 'Умойся. Грязная, как чертенок. Так ли подобает выглядеть леди из знатного рода?' Затем он протянул ей остывшую краюху хлеба. 'Все, что было у возницы. Любит он тебя. Голодной не оставит. Ешь и возвращайся в карету'. Виктория вновь послушалась. Хлеб оказался очень вкусным. Поблагодарив возничего - человека с очень добрыми глазами - кивком головы, она вернулась в карету. Кажется, путь был неблизкий. Дорога укачивала..."
}
